tap "github/bootstrap"
tap "github/packages"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

brew "coreutils", link: false

# Bash 4
brew "bash"

# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"

# More intuitive version of du in rust
brew "dust"

# Modern replacement for 'ls'
brew "exa"

# Version Control
brew "git"

# Improved top (interactive process viewer)
brew "htop"

# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"

# Lightweight and flexible command-line JSON processor
brew "jq"

# Mini DNS server designed solely to route queries to localhost
brew "launchdns", restart_service: true

# Mac App Store command-line interface
brew "mas"

# NCurses Disk Usage
brew "ncdu"

# NodeJS
brew "node"

# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"

# Fish shell
brew "fish"

# Password manager that keeps all passwords secure behind one password
cask "1password"

# Documentation search utility
cask "dash"

# Command-line tool for GitHub
cask "hub"

# MacOS overlayed video player
cask "iina"

# iTerm2 terminal
cask "iterm2"

# Secure introspectable tunnels to localhost
cask "ngrok"

#  Mac database management application
cask "sequel-pro"

# Text Editor
cask "sublime-text"